# E-Commerce Dataset Visualization
This ipynb file deals with exploring, cleaning, preprocessing and feature engineering of the e-commerce dataset to make it ready for visualization

In [1]:
import pandas as pd

# Load the dataset
file_path = "/content/train.csv"
df = pd.read_csv(file_path)

# Display basic info
print(df.info())
print(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9800 entries, 0 to 9799
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9800 non-null   int64
 1   Order ID       9800 non-null   object
 2   Order Date     9800 non-null   object
 3   Ship Date      9800 non-null   object
 4   Ship Mode      9800 non-null   object
 5   Customer ID    9800 non-null   object
 6   Customer Name  9800 non-null   object
 7   Segment        9800 non-null   object
 8   Country        9800 non-null   object
 9   City           9800 non-null   object
 10  State          9800 non-null   object
 11  Postal Code    9789 non-null   float64
 12  Region         9800 non-null   object
 13  Product ID     9800 non-null   object
 14  Category       9800 non-null   object
 15  Sub-Category   9800 non-null   object
 16  Product Name   9800 non-null   object
 17  Sales          9800 non-null   float64
dtypes: float64(2), int64(1), object(15)
memory usage: 1.3+ MB
None
   Row ID        Order ID  Order Date   Ship Date       Ship Mode Customer ID  \
0       1  CA-2017-152156  08/11/2017  11/11/2017    Second Class    CG-12520
1       2  CA-2017-152156  08/11/2017  11/11/2017    Second Class    CG-12520
2       3  CA-2017-138688  12/06/2017  16/06/2017    Second Class    DV-13045
3       4  US-2016-108966  11/10/2016  18/10/2016  Standard Class    SO-20335
4       5  US-2016-108966  11/10/2016  18/10/2016  Standard Class    SO-20335

     Customer Name    Segment        Country             City       State  \
0      Claire Gute   Consumer  United States        Henderson    Kentucky
1      Claire Gute   Consumer  United States        Henderson    Kentucky
2  Darrin Van Huff  Corporate  United States      Los Angeles  California
3   Sean O'Donnell   Consumer  United States  Fort Lauderdale     Florida
4   Sean O'Donnell   Consumer  United States  Fort Lauderdale     Florida

   Postal Code Region       Product ID         Category Sub-Category  \
0      42420.0  South  FUR-BO-10001798        Furniture    Bookcases
1      42420.0  South  FUR-CH-10000454        Furniture       Chairs
2      90036.0   West  OFF-LA-10000240  Office Supplies       Labels
3      33311.0  South  FUR-TA-10000577        Furniture       Tables
4      33311.0  South  OFF-ST-10000760  Office Supplies      Storage

                                        Product Name     Sales
0                  Bush Somerset Collection Bookcase  261.9600
1  Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400
2  Self-Adhesive Address Labels for Typewriters b...   14.6200
3      Bretford CR4500 Series Slim Rectangular Table  957.5775
4                     Eldon Fold 'N Roll Cart System   22.3680

Missing Value Analysis

In [2]:
# Check for missing values
print(df.isnull().sum())

Row ID            0
Order ID          0
Order Date        0
Ship Date         0
Ship Mode         0
Customer ID       0
Customer Name     0
Segment           0
Country           0
City              0
State             0
Postal Code      11
Region            0
Product ID        0
Category          0
Sub-Category      0
Product Name      0
Sales             0
dtype: int64

In [3]:
# Drop missing values from Postal code since they are very few
df = df.dropna(subset=['Postal Code'])

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 9789 entries, 0 to 9799
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9789 non-null   int64
 1   Order ID       9789 non-null   object
 2   Order Date     9789 non-null   object
 3   Ship Date      9789 non-null   object
 4   Ship Mode      9789 non-null   object
 5   Customer ID    9789 non-null   object
 6   Customer Name  9789 non-null   object
 7   Segment        9789 non-null   object
 8   Country        9789 non-null   object
 9   City           9789 non-null   object
 10  State          9789 non-null   object
 11  Postal Code    9789 non-null   float64
 12  Region         9789 non-null   object
 13  Product ID     9789 non-null   object
 14  Category       9789 non-null   object
 15  Sub-Category   9789 non-null   object
 16  Product Name   9789 non-null   object
 17  Sales          9789 non-null   float64
dtypes: float64(2), int64(1), object(15)
memory usage: 1.4+ MB
None

Check for Duplicate entries

In [4]:
# Check for duplicates
print(f"Duplicates: {df.duplicated().sum()}")

Duplicates: 0

Date conversions

In [10]:
# Converting to standard format
df['Order Date'] = pd.to_datetime(df['Order Date'], dayfirst=True)

In [11]:
df['Order Date']

0      2017-11-08
1      2017-11-08
2      2017-06-12
3      2016-10-11
4      2016-10-11
          ...
9795   2017-05-21
9796   2016-01-12
9797   2016-01-12
9798   2016-01-12
9799   2016-01-12
Name: Order Date, Length: 9789, dtype: datetime64[ns]

Creating New Features

In [13]:
#Total Revenue
total_revenue = df['Sales'].sum()
print(f"Total Revenue: ${total_revenue:.2f}")

Total Revenue: $2252607.41

In [15]:
# Total Orders
num_orders = df['Order ID'].nunique()
print(f"Total Orders: {num_orders}")

Total Orders: 4916

In [16]:
#Average Order Value
avg_order_value = total_revenue / num_orders
print(f"Average Order Value: ${avg_order_value:.2f}")

Average Order Value: $458.22

In [17]:
#Yearly Sales
df['year'] = df['Order Date'].dt.to_period('Y')
monthly_sales = df.groupby('year')['Sales'].sum().reset_index()

In [19]:
#Monthly Sales
df['month'] = df['Order Date'].dt.to_period('M')
monthly_sales = df.groupby('month')['Sales'].sum().reset_index()

In [20]:
#Quarterly Sales
df['quarter'] = df['Order Date'].dt.to_period('Q')
quarterly_sales = df.groupby('quarter')['Sales'].sum().reset_index()

Final Dataset

In [22]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 9789 entries, 0 to 9799
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9789 non-null   int64
 1   Order ID       9789 non-null   object
 2   Order Date     9789 non-null   datetime64[ns]
 3   Ship Date      9789 non-null   object
 4   Ship Mode      9789 non-null   object
 5   Customer ID    9789 non-null   object
 6   Customer Name  9789 non-null   object
 7   Segment        9789 non-null   object
 8   Country        9789 non-null   object
 9   City           9789 non-null   object
 10  State          9789 non-null   object
 11  Postal Code    9789 non-null   float64
 12  Region         9789 non-null   object
 13  Product ID     9789 non-null   object
 14  Category       9789 non-null   object
 15  Sub-Category   9789 non-null   object
 16  Product Name   9789 non-null   object
 17  Sales          9789 non-null   float64
 18  year           9789 non-null   period[Y-DEC]
 19  month          9789 non-null   period[M]
 20  quarter        9789 non-null   period[Q-DEC]
dtypes: datetime64[ns](1), float64(2), int64(1), object(14), period[M](1), period[Q-DEC](1), period[Y-DEC](1)
memory usage: 1.6+ MB
None

In [23]:
print(df.head())

   Row ID        Order ID Order Date   Ship Date       Ship Mode Customer ID  \
0       1  CA-2017-152156 2017-11-08  11/11/2017    Second Class    CG-12520
1       2  CA-2017-152156 2017-11-08  11/11/2017    Second Class    CG-12520
2       3  CA-2017-138688 2017-06-12  16/06/2017    Second Class    DV-13045
3       4  US-2016-108966 2016-10-11  18/10/2016  Standard Class    SO-20335
4       5  US-2016-108966 2016-10-11  18/10/2016  Standard Class    SO-20335

     Customer Name    Segment        Country             City  ...  \
0      Claire Gute   Consumer  United States        Henderson  ...
1      Claire Gute   Consumer  United States        Henderson  ...
2  Darrin Van Huff  Corporate  United States      Los Angeles  ...
3   Sean O'Donnell   Consumer  United States  Fort Lauderdale  ...
4   Sean O'Donnell   Consumer  United States  Fort Lauderdale  ...

  Postal Code  Region       Product ID         Category Sub-Category  \
0     42420.0   South  FUR-BO-10001798        Furniture    Bookcases
1     42420.0   South  FUR-CH-10000454        Furniture       Chairs
2     90036.0    West  OFF-LA-10000240  Office Supplies       Labels
3     33311.0   South  FUR-TA-10000577        Furniture       Tables
4     33311.0   South  OFF-ST-10000760  Office Supplies      Storage

                                        Product Name     Sales  year    month  \
0                  Bush Somerset Collection Bookcase  261.9600  2017  2017-11
1  Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400  2017  2017-11
2  Self-Adhesive Address Labels for Typewriters b...   14.6200  2017  2017-06
3      Bretford CR4500 Series Slim Rectangular Table  957.5775  2016  2016-10
4                     Eldon Fold 'N Roll Cart System   22.3680  2016  2016-10

  quarter
0  2017Q4
1  2017Q4
2  2017Q2
3  2016Q4
4  2016Q4

[5 rows x 21 columns]

Saving New Dataset

In [24]:
df.to_csv("/content/cleaned_ecommerce_data.csv", index=False)